<details ><summary>apply for production 2025-10-30 20:09:59 (UTC)</summary>
    <details ><summary>Apply output</summary>

```terraform
OpenTofu will perform the following actions:

  # cloudflare_dns_record.bsky_record will be created
  + resource "cloudflare_dns_record" "bsky_record" {
      + content          = "did=did:plc:r74f3l5bzuodnjekrf364t2v"
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "_atproto"
      + proxiable        = (known after apply)
      + proxied          = false
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "TXT"
      + zone_id          = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_dns_record.dmarc will be created
  + resource "cloudflare_dns_record" "dmarc" {
      + content          = "v=DMARC1; p=quarantine; rua=mailto:me@mirror-kt.dev; ruf=mailto:me@mirror-kt.dev"
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "_dmarc"
      + proxiable        = (known after apply)
      + proxied          = false
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "TXT"
      + zone_id          = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_dns_record.dub_sh will be created
  + resource "cloudflare_dns_record" "dub_sh" {
      + content          = "cname.dub.sh"
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "s"
      + proxiable        = (known after apply)
      + proxied          = false
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "CNAME"
      + zone_id          = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_dns_record.github_pages_challenge will be created
  + resource "cloudflare_dns_record" "github_pages_challenge" {
      + content          = "5ccd0ccb2e561700cb4bc02bfb98f1"
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "_github-pages-challenge-mirror-kt"
      + proxiable        = (known after apply)
      + proxied          = false
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "TXT"
      + zone_id          = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_dns_record.google_workspace will be created
  + resource "cloudflare_dns_record" "google_workspace" {
      + content          = "google-site-verification=HOfSNNDUwvlVJsp2TP7dwJCBub6fX7-Kpw1VGXZ2Ogg"
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "mirror-kt.dev"
      + proxiable        = (known after apply)
      + proxied          = false
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "TXT"
      + zone_id          = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_dns_record.keybase will be created
  + resource "cloudflare_dns_record" "keybase" {
      + content          = "keybase-site-verification=BUwOwC7eaSNWlnpB9toKGrkWPbK8Mnx5C4p1_PxLENE"
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "_keybase"
      + proxiable        = (known after apply)
      + proxied          = false
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "TXT"
      + zone_id          = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_dns_record.mail will be created
  + resource "cloudflare_dns_record" "mail" {
      + content          = "smtp.google.com"
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "mirror-kt.dev"
      + priority         = 1
      + proxiable        = (known after apply)
      + proxied          = false
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "MX"
      + zone_id          = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_dns_record.root will be created
  + resource "cloudflare_dns_record" "root" {
      + content          = "mirror-kt.pages.dev"
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "mirror-kt.dev"
      + proxiable        = (known after apply)
      + proxied          = true
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "CNAME"
      + zone_id          = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_dns_record.spf will be created
  + resource "cloudflare_dns_record" "spf" {
      + content          = "v=spf1 include:_spf.google.com ~all"
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "mirror-kt.dev"
      + proxiable        = (known after apply)
      + proxied          = false
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "TXT"
      + zone_id          = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

Plan: 9 to add, 0 to change, 0 to destroy.
cloudflare_dns_record.mail: Creating...
cloudflare_dns_record.dmarc: Creating...
cloudflare_dns_record.spf: Creating...
cloudflare_dns_record.bsky_record: Creating...
cloudflare_dns_record.dub_sh: Creating...
cloudflare_dns_record.root: Creating...
cloudflare_dns_record.github_pages_challenge: Creating...
cloudflare_dns_record.google_workspace: Creating...
cloudflare_dns_record.keybase: Creating...
cloudflare_dns_record.dmarc: Creation complete after 1s [id=753bcac05c1bb8342a45f40cf45f0c38]
cloudflare_dns_record.spf: Creation complete after 1s [id=b3e2de18b1ca07887ca71bf75fe8481f]
cloudflare_dns_record.github_pages_challenge: Creation complete after 1s [id=03e048b7ebdedd850918be48858dc04d]
cloudflare_dns_record.keybase: Creation complete after 1s [id=2955ac55ac16677a9f942dfa757ec17d]
cloudflare_dns_record.google_workspace: Creation complete after 1s [id=5da91870352c655f5dc892f81894fd87]
cloudflare_dns_record.bsky_record: Creation complete after 2s [id=d3264e59baaccee763d93fc6d0ef99f5]

```
</details>

<details ><summary>Error during applying.</summary>
  exit status 1
</details>

</details>